{
  "game-theory": {
    "title": "Game Theory",
    "passes": true,
    "quality_score": 8,
    "reason": "Comprehensive overview of game theory with key concepts, practical applications (currency attack model), and clear explanations of Nash Equilibrium, dominant strategies, and strategic thinking."
  },
  "radical-or-knightean-uncertainty": {
    "title": "Radical or Knightean Uncertainty",
    "passes": true,
    "quality_score": 7,
    "reason": "The document presents a philosophical discussion on uncertainty and risk, which is suitable for public viewing. It is technically sound, with no apparent errors, but could benefit from clearer explanations and examples to enhance clarity and engagement."
  },
  "ishita": {
    "title": "Ishita",
    "passes": true,
    "quality_score": 7,
    "reason": "The content is respectful and thought-provoking, suitable for public viewing. It lacks excessive personal details and maintains a focus on the subject's ideas. The writing is clear, but could benefit from more context or depth."
  },
  "simulations": {
    "title": "Simulations",
    "passes": true,
    "quality_score": 6,
    "reason": "The content is suitable for public viewing and presents a technical perspective on simulations in AI. However, it lacks depth and context, making it less accessible to a broader audience. The writing could benefit from clearer explanations and more structured formatting."
  },
  "nash-equilibrium": {
    "title": "Nash Equilibrium",
    "passes": true,
    "quality_score": 7,
    "reason": "The document presents a clear and concise explanation of Nash Equilibrium with appropriate technical definitions and properties. However, it could benefit from more examples and a smoother flow for broader audience engagement."
  },
  "dynamic-programming-dp": {
    "title": "Dynamic Programming (DP)",
    "passes": true,
    "quality_score": 7,
    "reason": "Comprehensive coverage of dynamic programming with corrected Python syntax. Includes top-down vs bottom-up approaches, memoization, tabulation, and multiple examples (climbing stairs, coin change, LIS, box stacking)."
  },
  "doc-2fcc119d": {
    "title": "초지능 전후 (한국어)",
    "passes": true,
    "quality_score": 8,
    "reason": "The document presents thoughtful insights on AGI and superintelligence, with a clear structure and logical arguments. It avoids overly personal content and maintains a professional tone suitable for a public blog. The writing quality is high, though some sections could benefit from clearer explanations for broader accessibility."
  },
  "before-and-after-superintelligence-part-i": {
    "title": "Before and After Superintelligence Part I",
    "passes": true,
    "quality_score": 7,
    "reason": "The document provides substantial insights into preparing for AGI and ASI, with clear explanations and actionable advice. However, some sections rely on references and concepts that may require additional context for full understanding, which slightly detracts from its standalone value."
  },
  "synthetic-data": {
    "title": "Synthetic Data",
    "passes": true,
    "quality_score": 7,
    "reason": "The document provides valuable insights into synthetic data and its applications in AI, with explanations of concepts like distillation and self-correction. However, it is somewhat fragmented and lacks deeper context in some areas, which may limit its standalone educational value."
  },
  "grpo": {
    "title": "GRPO",
    "passes": true,
    "quality_score": 8,
    "reason": "Comprehensive overview of GRPO algorithm with intuitive explanations, mathematical formulation, and comparison to PPO. Duplicated content removed."
  },
  "monte-carlo-tree-search": {
    "title": "Monte Carlo Tree Search",
    "passes": true,
    "quality_score": 8,
    "reason": "The document provides a clear and detailed explanation of the Monte Carlo Tree Search algorithm, including definitions, high-level steps, and mathematical context. It offers valuable insights into the advantages and challenges of MCTS, making it educational and informative for readers."
  },
  "commodity-futures": {
    "title": "Commodity Futures",
    "passes": true,
    "quality_score": 7,
    "reason": "The document provides a decent overview of commodity futures, including definitions and examples. However, it lacks depth in explanations and context for some points, which may leave readers wanting more clarity on certain aspects."
  },
  "oil-refinery": {
    "title": "Oil Refinery",
    "passes": true,
    "quality_score": 8,
    "reason": "Comprehensive standalone explanation of oil refinery operations, crude oil properties, refinery complexity levels, crack spreads, and investment considerations. No longer relies on image placeholders."
  },
  "gradient-boosted-models": {
    "title": "Gradient Boosted Models",
    "passes": true,
    "quality_score": 7,
    "reason": "The document provides a good overview of gradient boosted models with explanations of key concepts, pros and cons, and a practical example. However, it relies on some wiki-links and could benefit from more context and depth in certain areas."
  },
  "p-value": {
    "title": "p-value",
    "passes": true,
    "quality_score": 8,
    "reason": "The document provides a comprehensive overview of p-values, including definitions, mathematical context, and practical implications. It explains various test statistics, motivations for their use, and common pitfalls, making it educational and valuable for readers interested in data science."
  },
  "multiple-hypothesis-testing": {
    "title": "Multiple Hypothesis Testing",
    "passes": true,
    "quality_score": 8,
    "reason": "Complete explanation of multiple hypothesis testing with intuitive examples, error metrics (FWER, FDR), correction methods (Bonferroni, Benjamini-Hochberg), and practical guidance."
  },
  "e-value": {
    "title": "e-value",
    "passes": true,
    "quality_score": 8,
    "reason": "The document provides clear definitions and explanations of e-values and their advantages over p-values, along with relevant examples and applications. It offers substantial educational value, particularly for readers interested in statistical testing and data science."
  },
  "bayes-theorem": {
    "title": "Bayes Theorem",
    "passes": true,
    "quality_score": 8,
    "reason": "Clear explanation of Bayes theorem with the formula, intuitive medical test example, discussion of base rates, and practical takeaways. No longer just an image placeholder."
  },
  "transformer": {
    "title": "Transformer",
    "passes": true,
    "quality_score": 8,
    "reason": "Comprehensive explanation of transformer architecture with attention mechanism, multi-head attention, encoder vs decoder, and discussion of why transformers scale. No longer fragmented bullet points."
  }
}
