{
  "game-theory": {
    "title": "Game Theory",
    "passes": false,
    "quality_score": 5,
    "reason": "The content is suitable for public viewing and technically sound, but it lacks depth and clarity, making it less informative and engaging."
  },
  "radical-or-knightean-uncertainty": {
    "title": "Radical or Knightean Uncertainty",
    "passes": true,
    "quality_score": 7,
    "reason": "The document presents a philosophical discussion on uncertainty and risk, which is suitable for public viewing. It is technically sound, with no apparent errors, but could benefit from clearer explanations and examples to enhance clarity and engagement."
  },
  "ishita": {
    "title": "Ishita",
    "passes": true,
    "quality_score": 7,
    "reason": "The content is respectful and thought-provoking, suitable for public viewing. It lacks excessive personal details and maintains a focus on the subject's ideas. The writing is clear, but could benefit from more context or depth."
  },
  "simulations": {
    "title": "Simulations",
    "passes": true,
    "quality_score": 6,
    "reason": "The content is suitable for public viewing and presents a technical perspective on simulations in AI. However, it lacks depth and context, making it less accessible to a broader audience. The writing could benefit from clearer explanations and more structured formatting."
  },
  "nash-equilibrium": {
    "title": "Nash Equilibrium",
    "passes": true,
    "quality_score": 7,
    "reason": "The document presents a clear and concise explanation of Nash Equilibrium with appropriate technical definitions and properties. However, it could benefit from more examples and a smoother flow for broader audience engagement."
  },
  "dynamic-programming-dp": {
    "title": "Dynamic Programming (DP)",
    "passes": false,
    "quality_score": 6,
    "reason": "The document contains useful information on dynamic programming but has several technical errors, such as syntax issues in code snippets and unclear explanations. Additionally, some sections could benefit from better organization and clarity."
  },
  "doc-2fcc119d": {
    "title": "초지능 전후 (한국어)",
    "passes": true,
    "quality_score": 8,
    "reason": "The document presents thoughtful insights on AGI and superintelligence, with a clear structure and logical arguments. It avoids overly personal content and maintains a professional tone suitable for a public blog. The writing quality is high, though some sections could benefit from clearer explanations for broader accessibility."
  },
  "before-and-after-superintelligence-part-i": {
    "title": "Before and After Superintelligence Part I",
    "passes": true,
    "quality_score": 8,
    "reason": "The document provides thoughtful insights on the implications of AGI and ASI, with actionable ideas and a personal perspective. It is well-structured and contains substantial content, making it suitable for publication in a digital garden style."
  },
  "synthetic-data": {
    "title": "Synthetic Data",
    "passes": true,
    "quality_score": 8,
    "reason": "The document provides a comprehensive overview of synthetic data, including trends, methods, and applications, with a clear structure and valuable insights. It appears to be written in a personal voice suitable for a digital garden style."
  },
  "grpo": {
    "title": "GRPO",
    "passes": true,
    "quality_score": 8,
    "reason": "The document provides a detailed and technical overview of Group Relative Policy Optimization (GRPO), including its innovations, features, and comparisons with Proximal Policy Optimization (PPO). It is well-structured, informative, and appears to be written in a personal note style suitable for a digital garden."
  },
  "monte-carlo-tree-search": {
    "title": "Monte Carlo Tree Search",
    "passes": true,
    "quality_score": 8,
    "reason": "The document provides a clear and informative overview of Monte Carlo Tree Search, including definitions, steps, advantages, and challenges. It is well-structured and contains valuable content suitable for a digital garden style blog."
  },
  "commodity-futures": {
    "title": "Commodity Futures",
    "passes": true,
    "quality_score": 7,
    "reason": "The document provides a solid overview of commodity futures, including key concepts, trading logistics, and practical examples. It is suitable for public viewing and reflects a personal understanding of the topic."
  },
  "oil-refinery": {
    "title": "Oil Refinery",
    "passes": true,
    "quality_score": 7,
    "reason": "The document provides a comprehensive overview of oil refineries, including their processes, economics, and recent events. It is well-structured with relevant content and appears to be written in a personal style suitable for a digital garden format."
  },
  "gradient-boosted-models": {
    "title": "Gradient Boosted Models",
    "passes": true,
    "quality_score": 7,
    "reason": "The document provides a solid overview of gradient boosted models, including definitions, pros and cons, and a practical example. It is well-structured and contains valuable insights for readers interested in data science and machine learning."
  },
  "p-value": {
    "title": "p-value",
    "passes": true,
    "quality_score": 8,
    "reason": "The document provides a comprehensive overview of p-values in statistical testing, including definitions, common test statistics, motivations for choices, and considerations for interpretation. It is well-structured and contains valuable insights, making it suitable for publication in a digital garden format."
  },
  "multiple-hypothesis-testing": {
    "title": "Multiple Hypothesis Testing",
    "passes": true,
    "quality_score": 6,
    "reason": "The document provides a concise overview of multiple hypothesis testing, including relevant concepts and methods. While it lacks some detail and completeness, it offers valuable insights suitable for a digital garden style blog."
  },
  "e-value": {
    "title": "e-value",
    "passes": true,
    "quality_score": 8,
    "reason": "The document provides a detailed and informative comparison of e-values and p-values, discussing their advantages, weaknesses, and applications. It includes technical explanations and references to notable contributors, making it suitable for publication in a digital garden style."
  },
  "bayes-theorem": {
    "title": "Bayes Theorem",
    "passes": false,
    "quality_score": 3,
    "reason": "The document lacks substantial content, as it contains only a screenshot and tags without any explanatory text or insights on Bayes Theorem."
  }
}