{
  "game-theory": {
    "title": "Game Theory",
    "passes": false,
    "quality_score": 4,
    "reason": "The content is suitable for public viewing and technically sound, but it lacks depth and clarity. The writing is somewhat vague and could benefit from more detailed explanations and examples to enhance understanding."
  },
  "radical-or-knightean-uncertainty": {
    "title": "Radical or Knightean Uncertainty",
    "passes": true,
    "quality_score": 7,
    "reason": "The document presents a philosophical discussion on uncertainty and risk, suitable for a public blog. It is technically sound with no apparent errors, though it could benefit from clearer explanations and more context for some readers."
  },
  "ishita": {
    "title": "Ishita",
    "passes": true,
    "quality_score": 7,
    "reason": "The content is respectful and reflects positively on the subject, while also engaging with relevant ideas about AI. However, it lacks depth and context, which affects clarity and information density."
  },
  "simulations": {
    "title": "Simulations",
    "passes": true,
    "quality_score": 6,
    "reason": "The content is suitable for public viewing, contains no personal information, and is technically sound. However, the writing lacks clarity and structure, making it somewhat difficult to follow. More context and explanation would improve the overall quality."
  },
  "nash-equilibrium": {
    "title": "Nash Equilibrium",
    "passes": true,
    "quality_score": 7,
    "reason": "The document provides a clear and concise explanation of Nash Equilibrium, including a formal definition and relevant properties. However, the writing could benefit from improved clarity and flow, particularly for readers who may not be familiar with game theory terminology."
  },
  "dynamic-programming-dp": {
    "title": "Dynamic Programming (DP)",
    "passes": false,
    "quality_score": 6,
    "reason": "The document provides a good overview of dynamic programming concepts and examples, but it contains several technical errors (e.g., incorrect syntax in code snippets, unclear explanations) that could confuse readers. Additionally, some sections lack clarity and coherence, impacting overall quality."
  },
  "doc-2fcc119d": {
    "title": "초지능 전후 (한국어)",
    "passes": true,
    "quality_score": 8,
    "reason": "The document presents thoughtful insights on AGI and superintelligence, with a clear structure and well-defined ideas. It avoids overly personal content and maintains a professional tone. The writing is generally clear, though some sections could benefit from more concise expression. Overall, it is suitable for public viewing and contains no apparent technical errors."
  }
}