{
  "game-theory": {
    "title": "Game Theory",
    "passes": false,
    "quality_score": 5,
    "reason": "The content is suitable for public viewing and technically sound, but it lacks depth and clarity, making it less informative and engaging."
  },
  "radical-or-knightean-uncertainty": {
    "title": "Radical or Knightean Uncertainty",
    "passes": true,
    "quality_score": 7,
    "reason": "The document presents a philosophical discussion on uncertainty and risk, which is suitable for public viewing. It is technically sound, with no apparent errors, but could benefit from clearer explanations and examples to enhance clarity and engagement."
  },
  "ishita": {
    "title": "Ishita",
    "passes": true,
    "quality_score": 7,
    "reason": "The content is respectful and thought-provoking, suitable for public viewing. It lacks excessive personal details and maintains a focus on the subject's ideas. The writing is clear, but could benefit from more context or depth."
  },
  "simulations": {
    "title": "Simulations",
    "passes": true,
    "quality_score": 6,
    "reason": "The content is suitable for public viewing and presents a technical perspective on simulations in AI. However, it lacks depth and context, making it less accessible to a broader audience. The writing could benefit from clearer explanations and more structured formatting."
  },
  "nash-equilibrium": {
    "title": "Nash Equilibrium",
    "passes": true,
    "quality_score": 7,
    "reason": "The document presents a clear and concise explanation of Nash Equilibrium with appropriate technical definitions and properties. However, it could benefit from more examples and a smoother flow for broader audience engagement."
  },
  "dynamic-programming-dp": {
    "title": "Dynamic Programming (DP)",
    "passes": false,
    "quality_score": 6,
    "reason": "The document contains useful information on dynamic programming but has several technical errors, such as syntax issues in code snippets and unclear explanations. Additionally, some sections could benefit from better organization and clarity."
  },
  "doc-2fcc119d": {
    "title": "초지능 전후 (한국어)",
    "passes": true,
    "quality_score": 8,
    "reason": "The document presents thoughtful insights on AGI and superintelligence, with a clear structure and logical arguments. It avoids overly personal content and maintains a professional tone suitable for a public blog. The writing quality is high, though some sections could benefit from clearer explanations for broader accessibility."
  },
  "before-and-after-superintelligence-part-i": {
    "title": "Before and After Superintelligence Part I",
    "passes": true,
    "quality_score": 7,
    "reason": "The document provides substantial insights into preparing for AGI and ASI, with clear explanations and personal reflections. However, it includes some references to external links and concepts that may not be fully explained, which could limit standalone value for some readers."
  },
  "synthetic-data": {
    "title": "Synthetic Data",
    "passes": true,
    "quality_score": 7,
    "reason": "The document provides valuable insights into synthetic data, including definitions and methods, but it is somewhat fragmented and could benefit from clearer explanations and context in some sections."
  },
  "grpo": {
    "title": "GRPO",
    "passes": true,
    "quality_score": 8,
    "reason": "The document provides a detailed explanation of the GRPO algorithm, including its innovations, features, and comparisons with PPO. It includes mathematical formulations and contextual explanations that enhance understanding, making it educational and valuable for readers interested in reinforcement learning and AI."
  },
  "monte-carlo-tree-search": {
    "title": "Monte Carlo Tree Search",
    "passes": true,
    "quality_score": 9,
    "reason": "The document provides a clear and detailed explanation of Monte Carlo Tree Search, including its definition, high-level steps, mathematical formulation, advantages, and challenges. It offers substantial educational value and is well-structured, making it suitable for publication."
  },
  "commodity-futures": {
    "title": "Commodity Futures",
    "passes": true,
    "quality_score": 7,
    "reason": "The document provides a decent overview of commodity futures, including definitions and examples. However, it lacks depth in explanations and context for some points, which may leave readers wanting more clarity on certain aspects."
  },
  "oil-refinery": {
    "title": "Oil Refinery",
    "passes": false,
    "quality_score": 4,
    "reason": "The document relies heavily on embedded images without substantial text explanations and consists of brief bullet points lacking context. It does not provide enough standalone educational value."
  },
  "gradient-boosted-models": {
    "title": "Gradient Boosted Models",
    "passes": true,
    "quality_score": 7,
    "reason": "The document provides a decent overview of gradient boosted models, including definitions, pros and cons, and a code example. However, it relies on some wiki-links for deeper understanding and lacks extensive explanations in certain areas, which limits its standalone educational value."
  },
  "p-value": {
    "title": "p-value",
    "passes": true,
    "quality_score": 8,
    "reason": "The document provides a comprehensive overview of p-values, including definitions, mathematical context, and practical implications. It explains various test statistics and their relevance, while also addressing common misconceptions and best practices. The content is detailed and educational, making it suitable for readers seeking to understand p-values in data science."
  },
  "multiple-hypothesis-testing": {
    "title": "Multiple Hypothesis Testing",
    "passes": false,
    "quality_score": 4,
    "reason": "The document is too brief and fragmented, lacking sufficient context and explanation for the concepts presented. It relies heavily on references to external methods and terms without providing standalone educational value."
  },
  "e-value": {
    "title": "e-value",
    "passes": true,
    "quality_score": 8,
    "reason": "The document provides a clear and detailed explanation of e-values compared to p-values, including their advantages, weaknesses, and applications. It includes mathematical definitions and context, making it educational and valuable for readers interested in data science."
  },
  "bayes-theorem": {
    "title": "Bayes Theorem",
    "passes": false,
    "quality_score": 3,
    "reason": "The document relies heavily on an embedded image without providing substantial text explanation or context, making it insufficiently informative as a standalone piece."
  }
}